{
    "lection-8hg": {
        "title": "Quantenannealer: Eine Einführung",
        "description": "...Aber was genau sind Quantencomputer? Wie funktionieren sie? Auf diese Fragen und mehr gibt diese Einführungslektion eine Antwort!",
        "content": {
            "lesson-S6N": {
                "title": "Was ist ein Qubit?",
                "content": {
                    "paragraph-1": {
                        "text": "Quantencomputer werden in der Berichterstattung vieler Medien immer präsenter — und die Behauptungen, sie wären in ihrer Rechenleistung klassischen Computern weit überlegen, würden diese bald ersetzen und sichere Verschlüsselungsmethoden der Gegenwart brechen. Aber wie viel davon ist wahr — und wie viel pure Übertreibung? Das Ziel dieses Kurses ist es, einen tiefen Einblick in das spannende Feld der Quanteninformatik zu geben, weshalb wir uns bedanken möchten, dass du Quantos nutzt! Auf dich wartet eine spaßige Lernerfahrung, nach dessen du eigene Rechenprobleme auf echten Quantencomputern lösen kannst."
                    },
                    "sectiontitle-1": {
                        "title": "Ein paar Grundlagen"
                    },
                    "paragraph-2": {
                        "text": "Dafür müssen wir aber bei den Grundlagen anfangen: Das **Qubit**, eine Mischung aus 'Quanten' und 'Bit' und das Herzstück dieser neuen Technologie, ist für die enorme Rechenleistung verantwortlich. Ein normaler Computer, so wie du ihn gerade wahrscheinlich in der Hand oder auf dem Tisch hast, arbeitet mit Bits, um Informationen zu speichern und zu berechnen. Diese sind binär — das bedeutet, sie sind entweder 1 oder 0. Das ist eigentlich nur eine mathematische Repräsentation, denn Bits sind meist Leiterbahnen aus Kupfer, in denen entweder Strom fließt (Zustand 1) oder nicht (Zustand 0). Das Besondere an Qubits: Sie können beide Zustände gleichzeitig bzw. eine Mischung davon annehmen."
                    },
                    "image-1": {
                        "asset": "assets/images/lessons/qubit_visualization.png",
                        "caption": "",
                        "alttext": "Die Ziffern 0 und 1 in Kreisen, daneben ein Kreis mit 0 und 1 übereinandergelegt"
                    },
                    "paragraph-3": {
                        "text": "Doch wie ist das möglich? Vielleicht kennst du das Gedankenexperiment vom Physiker Erwin Schrödinger: In einer Kiste befindet sich eine Katze, welche durch ein Gift getötet wird, sobald ein instabiler Atomkern zerfällt; wann das passiert, kann man nicht genau vorhersagen. Bis zu dem Zeitpunkt, wo man in die Kiste hineinblickt, ist das Atom zerfallen und nicht zerfallen zugleich — und die Katze somit lebendig und tot zugleich."
                    },
                    "paragraph-4": {
                        "text": "Die kleinste Welt der Atome, der Quanten, benimmt sich völlig anders, als was wir mit bloßem Auge wahrnehmen können und die Gesetze der klassischen Physik gelten dort nicht. Daher hat sie ihren eigenen Zweig bekommen: Die Quantenphysik. Sie ganz zu verstehen, ist selbst für gelernte Physiker eine Schwierigkeit, die grundlegenden Modelle aber können von allen nachvollzogen werden. Die Quantenphysik geht davon aus, dass quantenmechanische Systeme — also Atome, Elektronen usw. — eine Überlagerung aller ihrer möglichen Zustände besitzen, die Superposition. Erst wenn man sie mit Geräten misst oder anderweitig beobachtet, entscheiden sie sich für einen bestimmten Zustand. Dies kombiniert mit der Erkenntnis, dass der nicht jeder Ausgang einer Messung gleich wahrscheinlich ist und durch eine Wellenfunktion beschrieben wird, wird als **Kopenhagener Deutung** bezeichnet."
                    },
                    "interactive-1": {

                    },
                    "paragraph-5": {
                        "text": "Dieses Verhalten kann man sich zunutze machen, um Qubits zu bauen — Einheiten, die eine Überlagerung von 0 und 1 darstellen, bis sie gemessen werden. Qubits können mit jedem atomaren System, welches mindestens zwei verschiedene Zustände besitzt, realisiert werden. Hier einige Beispiele:"
                    },
                    "image-2": {
                        "asset": "assets/images/lessons/electron_spin_example.png",
                        "caption": "Up- und Down-Spins von Elektronen könnten als Qubits dienen.",
                        "alttext": "Zwei schematische Darstellungen von Elektronen, bei dem der eine Pfeil nach oben (Schriftzug up) und der andere nach unten (Schriftzug down) zeigt."
                    },
                    "image-3": {
                        "asset": "assets/images/lessons/ion_example.png",
                        "caption": "Genauso wie verschiedenen Energieniveaus von Ionen, die durch Elektronen auf verschiedenen Bahnen entstehen.",
                        "alttext": "Zwei schematische Darstellungen von Atomen, bei dem sich das eine Elektron auf der näheren (Zustand 0) und das andere auf der ferneren Bahn (Zustand 1) befindet."
                    },
                    "image-4": {
                        "asset": "assets/images/lessons/superconductor_example.png",
                        "caption": "Schleifen aus supraleitenden Materialien, die zwei Zustände annehmen können.",
                        "alttext": "Ein Ring aus leitendem Material, in dessen Mitte ein Pfeil nach oben und ein Pfeil nach unten zeigt."
                    },
                    "paragraph-6": {
                        "text": "Dabei ist ein Qubit (in der Mathematik meist mit $$\\Psi$$ darsgestellt) immer eine Mischung aus $$\\vert 0\\rangle$$ (aus) und $$\\vert 1\\rangle$$ (ein). Welcher Anteil des jeweiligen Zustands vorhanden ist, wird durch zwei Zahlen $$\\alpha$$ und $$\\beta$$ ausgedrückt, die zusammen immer 1 ergeben."
                    }
                }
            }
        }
    }
}
