Repository: Totemi1324/Quantos
Catalog: l10n/*.arb
Languages: de

# confirmButtonLabel
source: Confirm
de: Weiter

# readyButtonLabel
source: I'm ready
de: Ich bin bereit

# finishButtonLabel
source: Finish
de: Fertig

# sendButtonLabel
source: Send
de: Senden

# workInProgressMessage
source: Beep boop... Work in progress detected... Come back later, human!
de: Beep boop... Funktion in Entwicklung gefunden... Versuche es später nochmal, Menschenwesen!

# loadingPlaceholder
source: Loading...
de: Laden...

# authSignUpDescription
source: New here?
de: Neu hier?

# authSignUpButtonLabel
source: Sign Up
de: Registrieren

# authLogInDescription
source: Already on board?
de: Bereits an Bord?

# authLogInButtonLabel
source: Log In
de: Einloggen

# authGroupAccessDescription
source: Part of a classroom or team?
de: Teil einer Klasse oder eines Teams?

# authGroupAccessButtonLabel
source: Enter Access Code
de: Zugangscode eingeben

# authSignUpScreenTitle
source: Welcome!
de: Willkommen!

# authLogInScreenTitle
source: Welcome back!
de: Willkommen zurück!

# authGroupAccessScreenTitle
source: Welcome!
de: Willkommen!

# authGroupAccessScreenInstructions
source: Enter your 6-digit access code
de: Gib deinen 6 Zeichen langen Zugangscode ein

# profileNameScreenTitle
source: Hi! What's your name?
de: Hi! Wie heißt du?

# profileNameScreenFormField
source: First name
de: Vorname

# profileNameScreenTextButtonLabel
source: I don't want to be called by my name
de: Ich möchte nicht mit Namen angesprochen werden

# profileAgeScreenTitleWithName
source: And how old are you, {name}?
de: Und wie alt bist du, {name}?

# profileAgeScreenTitleWithoutName
source: And how old are you?
de: Und wie alt bist du?

# profileAgeScreenInstructions
source: We need this information to choose the optimal learning contents for you.
de: Wir benötigen diese Informationen, um deine optimalen Lerninhalte auszuwählen.

# profileExperienceScreenTitle
source: How would you describe yourself?
de: Wie würdest du dich beschreiben?

# profileExperienceScreenInstructions
source: That is, how familiar are you with quantum computing in general?
de: Genauer: Wie vertraut bist du mit dem Thema Quantencomputing im Allgemeinen?

# profileExperienceScreenSliderClass1
source: Beginner
de: Anfänger

# profileExperienceScreenSliderClass2
source: Advanced
de: Fortgeschritten

# profileExperienceScreenSliderClass3
source: Skilled
de: Erfahren

# homeScreenTitleWithName
source: Hello {name}!
de: Hallo {name}!

# homeScreenTitleWithoutName
source: Hello!
de: Hallo!

# homeScreenLectionsSection
source: Lections
de: Lektionen

# statisticsScreenTitle
source: Statistics
de: Statistiken

# statisticsScreenProgressSubtitle
source: completed
de: abgeschlossen

# statisticsScreenDisclaimer
source: Usage data older than 30 days is deleted automatically
de: Nutzungsdaten, die älter als 30 Tage sind, werden automatisch gelöscht

# profileScreenAffiliation
source: belonging to {institution}
de: zugewiesen zu {institution}

# profileScreenOptionsSection
source: Account settings
de: Account-Einstellungen

# profileScreenOptionGroups
source: Manage groups
de: Gruppen verwalten

# profileScreenOptionPersonal
source: Edit personal settings
de: Persönliche Daten bearbeiten

# profileScreenOptionPassword
source: Change password
de: Passwort ändern

# profileScreenOptionDelete
source: Delete account
de: Account löschen

# downloadScreenTitle
source: Download Center
de: Download-Zentrum

# downloadScreenInstructions
source: Here, you find helper programs (desktop only) and materials for further reading that didn't make the cut in the final lessons. Happy browsing!
de: Hier findest du Hilfsprogramme (nur für Desktop) und Materialien zur weiteren Lektüre, die es nicht in die finalen Einheiten geschafft haben. Viel Spaß beim Stöbern!

# codingScreenInstructions
source: Ready to take matters in your own hands? Send your Hamilton matrices to our simulator or a real-life DWave quantum annealer and use the results to solve problems nobody ever attempted before!
de: Bist du bereit, die Dinge selbst in die Hand zu nehmen? Schicke deine Hamilton-Matrizen an unseren Simulator oder einen echten DWave-Quantenannealer und nutze die Ergebnisse, um Probleme zu lösen, die noch niemand zuvor versucht hat!

# codingScreenWarningTitle
source: Warning
de: Achtung

# codingScreenWarning
source: The introductory lection 'Introduction to Quantum Annealers' contains the information and knowledge necessary for using the coding interface. If you're inexperienced with quantum annealing, make sure to check that out first!
de: Die Einführungslektion 'Einführung zu Quantenannealern' enthält die Informationen und Kenntnisse, die für die Verwendung der Coding-Oberfläche erforderlich sind. Wenn du noch keine Erfahrung mit Quantenannealern hast, ist es hilfreich, es dir zuerst anzuschauen!

# lectionScreenLessonsSection
source: Lessons
de: Einheiten

# lectionScreenDifficultyClass1
source: Easy
de: Einfach

# lectionScreenDifficultyClass2
source: Advanced
de: Fortgeschritten

# lectionScreenDifficultyClass3
source: Challenging
de: Herausfordernd

# lessonScreenOutlinesNavigation
source: Jump to sections
de: Abschnitt wählen

# settingsScreenTitle
source: Settings
de: Einstellungen

# infoScreenTitle
source: App Information
de: App-Informationen

# infoScreenVersion
source: Version number
de: Versionsnummer

# infoScreenBuild
source: Build number
de: Build-Nummer

# infoScreenImprintSection
source: Imprint
de: Impressum

# infoScreenImprintResponsiblePartyTitle
source: Resposible party
de: Verantwortlicher

# infoScreenImprintContactTitle
source: Contact
de: Kontakt

# infoScreenPrivacySection
source: Privacy policy
de: Datenschutz

# infoScreenPrivacyDescription
source: Visit our website {website} to learn more about our Privacy Policy. In short: We don't collect data about you, other the ones you personally provided :)
de: Auf unserer Website {website} kannst du unsere Datenschutzerklärung nachlesen. Kurz gesagt: Wir sammeln keine Daten über dich, außer denen, die du persönlich angegeben hast :)

# helpScreenTitle
source: Help Center
de: Hilfe-Center

# helpScreenInstructions
source: We're sorry if you're experiencing trouble. Please describe your request in detail and we will get back to you on the email address linked to your account.
de: Wir bitten um Entschuldigung, solltest du Probleme mit der App haben. Bitte schildere uns dein Anliegen im Detail und wir werden uns über die mit deinem Konto verknüpfte E-Mail-Adresse bei dir melden.

# authFormPassword
source: Password
de: Passwort

# authFormConfirmPassword
source: Confirm password
de: Passwort bestätigen

# notificationNewsTitle
source: News
de: Neuigkeiten

# notificationStatisticTitle
source: Your activity
de: Deine Aktivität

# statisticsListElementActivityTitle
source: Activity
de: Aktivität

# statisticsListElementActivitySubtitle
source: this month
de: diesen Monat

# statisticsListElementPerformanceTitle
source: Performance
de: Leistung

# statisticsListElementPerformanceSubtitle
source: in the last 7 days
de: in den letzten 7 Tagen

# statisticsListElementPerformanceLegend
source: completed lessons per day
de: abgeschlossene Einheiten pro Tag

# statisticsListElementProgressTitle
source: Progress
de: Fortschritt

# codingInfoTitle
source: Coding modes
de: Coding-Modus

# codingInfoSimulator
source: calculates the five best solutions to your Hamiltonian locally and displays them as they would come from a real quantum annealer, giving you freedom to experiment and a sense of how the real thing works. Additionally, it provides an approximate probability distribution to show how likely each result would show up.
de: berechnet die fünf besten Lösungen für deinen Hamiltonian lokal und zeigt sie so an, wie sie von einem echten Quantenannealer kommen würden. So hast du die Freiheit, zu experimentieren und bekommst ein Gefühl dafür, wie das richtige Gerät funktioniert. Zusätzlich bietet er eine ungefähre Wahrscheinlichkeitsverteilung, um zu zeigen, wie wahrscheinlich jedes Ergebnis wäre.

# codingInfoAnnealer
source: sends your Hamiltonian to the latest model of a real quantum annealer by DWave Systems with 5627 qubits. In order to use this mode, you have to provide your API token. Instructions on how to create a Leap account and get your token are on our website. For security reasons, we don't save your token, so you have to re-enter it every time you want to send an optimization problem.
de: sendet deinen Hamiltonian an das neueste Modell eines echten Quantenannealers von DWave Systems mit 5627 Qubits. Um diesen Modus nutzen zu können, musst du dein API-Token angeben. Eine Anleitung, wie du ein Leap-Konto erstellen und dein Token erhalten kannst, findest du auf unserer Website. Aus Sicherheitsgründen speichern wir deinen Token nicht, sodass du es jedes Mal neu eingeben musst, wenn du ein Optimierungsproblem senden möchtest.

# codingTokenFormFieldSectionTitle
source: Authentication
de: Authentifizierung

# codingTokenFormFieldTitle
source: Your API token:
de: Dein API-Token:

# codingTokenFormField
source: Paste your token here
de: Füge deinen Token hier ein

# codingHamiltonianInputLoadButtonLabel
source: Load local
de: Lokal laden

# codingHamiltonianInputInstructions
source: Upon sending, empty fields will be set to 0.
de: Beim Senden werden leere Felder auf 0 gesetzt.

# codingConsoleOutputTitleSimulator
source: Response from the simulator
de: Antwort des Simulators

# codingConsoleOutputTitleAnnealer
source: Response from the DWave annealer
de: Antwort des DWave-Annealers

# codingConsoleOutputMessageIdle
source: Waiting for input.
de: Warte auf Eingabe.

# codingConsoleOutputMessageLoading
source: Waiting for response...
de: Warte auf Antwort des Servers...

# codingConsoleOutputMessageSuccess
source: Operation successful! Here are the top solutions (up to 5), sorted from best to worst energy:
de: Ausführung erfolgreich! Hier sind die besten Lösungen (bis zu 5), sortiert von der besten bis zur schlechtesten Energie:

# codingConsoleOutputMessageFailure
source: Something went wrong - unable to fetch response. If you're using DWave Advantage mode, check your internet connection, or try again.
de: Etwas ist schief gelaufen - Antwort kann nicht abgerufen werden. Wenn du den DWave Advantage-Modus verwendest, überprüfe deine Internetverbindung oder versuche es erneut.

# codingProbabilityTitle
source: Probability distribution
de: Wahrscheinlichkeitsverteilung

# codingProbabilityDescription
source: This simulates how likely you would get each result on a real quantum annealer, from best to worst. At this temparature of the QPU, the best solution to your problem has a {percentage} chance to be found.
de: Dies simuliert, wie wahrscheinlich die einzelnen Ergebnisse auf einem echten Quantenannealer wären, von der besten bis zur schlechtesten Lösung. Bei dieser Temperatur der QPU beträgt die Wahrscheinlichkeit der besten Lösung für dein Problem {percentage}.

# themeDark
source: Dark
de: Dunkel

# themeLight
source: Light
de: Hell

# settingsSectionAccessibility
source: Accessibility options
de: Barrierefreiheit

# settingsSectionVisuals
source: Visuals
de: Darstellung

# settingsSectionOther
source: Others
de: Sonstige

# settingsOptionAccessibilityMode
source: Accessibility mode
de: Sehschwäche-Modus

# settingsOptionColorblindTheme
source: Enable colorblind theme
de: Farbschema für Farbenblindheit aktivieren

# settingsOptionTheme
source: Choose theme
de: Farbschema wählen

# settingsOptionLanguage
source: Language
de: Sprache

# helpRequestTypeAccont
source: I have a problem regarding my account
de: Ich habe ein Problem mit meinem Account

# helpRequestTypeBug
source: I want to report a bug/error in the app
de: Ich möchte einen Bug/Fehler in der App melden

# helpRequestTypeFeature
source: I have an inquiry about the app or its contents
de: Ich habe eine Frage zur App oder zu ihrem Inhalt

# helpRequestTypeOther
source: Other
de: Sonstiges

# helpInstructions
source: Select a category:
de: Wähle eine Kategorie:

# helpMessageFormField
source: Your message
de: Deine Nachricht

# parsingErrorParagraph
source: Oops! It seems that the resource you requested is corrupted and cannot be parsed. We're sorry for the inconvenience, as this error likely means something went wrong on our end. Hence, we would be thankful if you submitted the following error message via our Help Center: {exception}
de: Ups! Es scheint, dass deine angeforderte Ressource beschädigt ist und nicht gelesen werden kann. Wir entschuldigen uns für die Unannehmlichkeiten, da dieser Fehler wahrscheinlich bedeutet, dass auf unserer Seite etwas schief gelaufen ist. Daher wären wir dir dankbar, wenn du die folgende Fehlermeldung über unser Hilfe-Center an uns übermittelst: {exception}

# unknownErrorParagraph
source: Oops! It seems that something went wrong while trying to load the resource you requested. You are receiving this error because even we don't know what caused it. In order to resolve your issues as soon as possible, please submit the following message through our Help Center: {exception}
de: Ups! Es scheint, dass beim Versuch, die angeforderte Ressource zu laden, etwas schief gelaufen ist. Du erhälst diese Meldung, weil wir selbst nicht wissen, was diesen Fehler verursacht hat. Um dein Problem so schnell wie möglich zu beheben, übermittle bitte die folgende Fehlernachricht über unseren Hilfe-Center: {exception}

# authenticationErrorEmailExists
source: The email address provided already belongs to another user. Please choose another address or, if you already created the account, try to log in instead!
de: Die angegebene Email-Adresse gehört bereits einem anderen Nutzer. Bitte wähle eine andere Adresse oder, wenn du bereits ein Konto erstellt hast, versuche stattdessen, dich einzuloggen!

# authenticationErrorTooManyAttempts
source: We detected too many sign up attempts for this email address and locked it temporarily due to potentially malicious activity. Please try again later!
de: Wir haben zu viele Anmeldeversuche für diese Email-Adresse festgestellt und sie aufgrund potenziell bösartiger Aktivitäten vorübergehend gesperrt. Bitte versuche es später noch einmal!

# authenticationErrorEmailNotFound
source: The email address provided does not belong to any account. If you are new here, sign up first to create your account! If you believe you got this message in error, please contact us at help@quantos.online.
de: Die angegebene Email-Adresse gehört zu keinem Konto. Wenn du neu hier bist, registriere zuerst dein Konto! Wenn du glaubst, dass du diese Nachricht irrtümlich erhalten hast, kontaktiere uns bitte unter help@quantos.online.

# authenticationErrorInvalidPassword
source: The password entered is incorrect. Try again!
de: Das eingegebene Passwort ist falsch. Bitte nochmal versuchen!

# authenticationErrorUserDisabled
source: Log in not possible because this account has been disabled. If you believe you got this message in error, please contact us at help@quantos.online.
de: Einloggen nicht möglich, da dieses Konto deaktiviert wurde. Wenn du glaubst, dass du diese Nachricht irrtümlich erhalten hast, kontaktiere uns bitte unter help@quantos.online.

# authenticationErrorUnknown
source: Something went wrong. Please try again later! If the issue persists, please contact us at help@quantos.online.
de: Etwas ist schief gelaufen. Bitte versuche es später noch einmal! Wenn das Problem weiterhin besteht, kontaktiere uns bitte unter help@quantos.online.

# validationFailEmailIncorrectFormat
source: Please enter a valid email address.
de: Bitte gib eine gülte Email-Adresse an.

# validationFailPasswordNotSufficient
source: Your password must fulfill the following requirements: - Minimum length of 10 characters - At least one letter - At least one number - At least one special character
de: Dein Passwort muss folgendes beinhalten: - Mindestens 10 Zeichen - Mindestens ein Buchstabe - Mindestens eine Zahl - Mindestens ein Sonderzeichen

# validationFailConfirmPasswordNoMatch
source: Passwords do not match.
de: Passwörter stimmen nicht überein.

# validationFailEmailMissing
source: Email address is required.
de: Email-Adresse ist erforderich.

# validationFailPasswordMissing
source: Password is required.
de: Passwort ist erforderlich.

# tooltipShowHidePassword
source: Show or hide password
de: Passwort anzeigen oder verbergen
