{
    "paragraph-1": {
        "text": "In this lection as well, we would like to show by way of example how one can improve the own procedure in order to exceed the theoretical capacity limit of the available qubits. Because by analyzing the properties of the optimization problem at hand and cleverly limiting the solution set, one can often save some qubits!"
    },
    "pagebreak-1": {
    },
    "sectiontitle-1": {
        "title": "Saving even more data"
    },
    "paragraph-2": {
        "text": "Since TSP tours are closed Hamiltonian paths (cycles) that visit every city, the starting point can be set **anywhere, arbitrarily**. So if we take this decision away from the quantum annealer and set the starting point to, say, A, the first row and the first column of the tour matrix can be omitted, since the first time step is thus already done and this city is guaranteed not to be visited in the rest of the cycle."
    },
    "image-1": {
        "asset": "tour_optimization.png",
        "caption": "If the first city visited is known, the column and row of this visit is irrelevant",
        "alttext": "Grid of alphabetical letters from a to p, whose columns are labeled one, two, three, four, and whose rows are labeled A, B, C, D; cells 1A, 2C, 3B, and 4D are highlighted in blue, row A and column 1 are shaded in red."
    },
    "paragraph-3": {
        "text": "We are not done here, though, because in addition the cost function must be adjusted so that the path from A to B, A to C, etc. depends only on the second node visited — the logical qubits for A must eventually **disappear entirely** from the QUBO equation, otherwise the optimization has no effect. This approach reduces the size of the tour matrix by 1, which means that the number of cities for which the annealer can find a solution increases to 9."
    },
    "pagebreak-2": {
    },
    "sectiontitle-2": {
        "title": "Incomplete graphs"
    },
    "paragraph-4": {
        "text": "To make the algorithm more applicable to real-world everyday situations, it would also be possible to extend it beyond the scope of the classical traveling salesman problem for **incomplete graphs** (where not all nodes are interconnected). In practice, it can often happen that not all nodes are reachable from every point. If a connection between two cities does not exist (e.g., due to the structure of a road network), the quantum annealer must be **prevented** from including it in the solution at all costs."
    },
    "image-2": {
        "asset": "incomplete_graph.png",
        "caption": "An example of an incomplete graph",
        "alttext": "Circles connected by gray lines; between some circles, there is no connection."
    },
    "pagebreak-3": {
    },
    "paragraph-5": {
        "text": "So, to represent a non-existent edge, one could impose a **massive penalty** on it, so that the lowest cost is never reached if it is part of the tour. In the mathematical literature this is usually expressed with an infinity symbol, but in our case a high integer value is more appropriate."
    },
    "equation-1": {
        "tex": "H=\\begin{bmatrix}-2&2&2&\\infty&0&\\hdots\\\\0&-2&\\infty&2&\\infty\\hdots\\\\0&0&-2&\\infty&2&\\hdots\\\\0&0&0&-2&\\infty\\hdots\\\\0&0&0&0&-2&\\hdots\\\\\\vdots\\vdots\\vdots\\vdots\\vdots\\ddots\\end{bmatrix}",
        "alttext": "H=[[-2,2,2,∞,0,⋯],[0,-2,∞,2,∞,⋯],[0,0,-2,∞,2,⋯],[0,0,0,-2,∞,⋯],[0,0,0,0,-2,⋯],[⋮,⋮,⋮,⋮,⋮,⋱]]"
    },
    "equation-2": {
        "tex": "\\Rightarrow\\begin{bmatrix}-2&2&2&100&0&\\hdots\\\\0&-2&100&2&100\\hdots\\\\0&0&-2&100&2&\\hdots\\\\0&0&0&-2&100\\hdots\\\\0&0&0&0&-2&\\hdots\\\\\\vdots\\vdots\\vdots\\vdots\\vdots\\ddots\\end{bmatrix}",
        "alttext": "⇒[[-2,2,2,100,0,⋯],[0,-2,100,2,100,⋯],[0,0,-2,100,2,⋯],[0,0,0,-2,100,⋯],[0,0,0,0,-2,⋯],[⋮,⋮,⋮,⋮,⋮,⋱]]"
    },
    "paragraph-6": {
        "text": "Optimizations that go beyond improving by a few problem sizes are only possible if the sparsity of the Hamiltonian matrix is increased, i.e., the number of non-zero entries is actually reduced."
    }
}