{
    "paragraph-1": {
        "text": "Quantum computers are becoming more and more present in the reporting of many media — and the claims that they are far superior in their computing power to classical computers, will soon replace them and break the secure encryption methods we use today. But how much of this is true — and how much pure exaggeration? The goal of this course is to provide a deep dive into the exciting field of quantum computing, which is why we want to thank you for using Quantos! A fun learning experience awaits you, after which you'll be able to solve your own computational problems on real quantum computers."
    },
    "sectiontitle-1": {
        "title": "A few basics"
    },
    "paragraph-2": {
        "text": "But to do that, we have to start with the basics: The **qubit**, a mixture of 'quantum' and 'bit' and the heart of this new technology, is responsible for the enormous computing power. A normal computer, like the one you probably have in your hand or on your desk right now, works with bits to store and calculate information. They are binary — that is, they are either 1 or 0. This is actually just a mathematical representation, because bits are mostly conductive paths made of copper in which either current flows (state 1) or not (state 0). What's special about qubits is that they can assume both states at the same time, or a mixture of them."
    },
    "image-1": {
        "asset": "qubit_visualization.png",
        "caption": "This is roughly how you can think of qubits: a blend of multiple states",
        "alttext": "The digits zero and one in circles, next to them a circle with zero and one superimposed."
    },
    "paragraph-3": {
        "text": "But how is that possible? Perhaps you heard of the thought experiment by physicist Erwin Schrödinger: in a box there is a cat, which is killed by a poison as soon as an unstable atomic nucleus decays; when this happens, one cannot predict exactly. By the time you look into the box, the atom has decayed and not decayed at the same time — and the cat is thus alive and dead at the same time."
    },
    "paragraph-4": {
        "text": "The smallest world of atoms, the quantum world, behaves completely different from what we can perceive with the naked eye and the laws of classical physics do not apply there. Therefore, it has its own scientific field: quantum physics. To comprehend it completely is a great difficulty even for learned physicists, but the basic models can be understood by everyone. Quantum physics assumes that quantum mechanical systems — atoms, electrons, etc. — have a **superposition** of all their possible states. Only when measured with instruments or otherwise observed do they decide on a particular state. This combined with the realization that not every outcome of a measurement is equally probable and is described by a wave function is called the Copenhagen interpretation."
    },
    "interactive-1": {

    },
    "paragraph-5": {
        "text": "This behavior can be exploited to build qubits — units that are a superposition of 0 and 1 until they are measured. Qubits can be realized with any atomic system that has at least two distinct states. Here are some examples:"
    },
    "image-2": {
        "asset": "electron_spin_example.png",
        "caption": "Up and down spins of electrons could serve as qubits",
        "alttext": "Two schematic representations of electrons, with one arrow pointing up (titled upspin) and the other pointing down (titled downspin)."
    },
    "image-3": {
        "asset": "ion_example.png",
        "caption": "Just like different energy levels of ions created by electrons on different orbits",
        "alttext": "Two schematic representations of atoms with one electron in the inner orbit (state zero) and the other in the outer orbit (state one)."
    },
    "image-4": {
        "asset": "superconductor_example.png",
        "caption": "Loops of superconducting materials that can assume two states",
        "alttext": "A ring of conductive material with an arrow pointing up and an arrow pointing down at its center."
    },
    "paragraph-6": {
        "text": "Thereby a qubit (in mathematics mostly represented by $$\\Psi$$) is always a mixture of $$\\vert 0\\rangle$$ (off) and $$\\vert 1\\rangle$$ (on). What fraction of each state is present is expressed by two numbers $$\\alpha$$ and $$\\beta$$, which together always add up to 1."
    },
    "equation-1": {
        "tex": "\\vert\\Psi\\rangle = \\alpha \\times \\vert 0\\rangle + \\beta \\times \\vert 1\\rangle",
        "alttext": "|Ψ⟩ = α × |0⟩ + β × |1⟩"
    },
    "paragraph-7": {
        "text": "The qubit $$0.3\\vert 0\\rangle + 0.7\\vert 1\\rangle$$, for example, becomes 0 and 1 with a probability of 30% and 70%, respectively, after the measurement (although this is highly simplified, because in reality these probabilities come from the number space of complex numbers). We can also visualize this geometrically: If we convert alpha and beta to angles with a multi-step mathematical procedure, the state of a qubit always lies on a sphere with radius 1. Superposition is achieved when the state is exactly in the middle between the two poles."
    },
    "image-5": {
        "asset": "bloch_sphere.png",
        "caption": "Illustration of a qubit on the so-called Bloch sphere",
        "alttext": "Sphere in a coordinate system, at the south pole one, at the north pole zero; qubit is plotted as a point on the surface of the upper hemisphere and its angle to the axes is marked."
    },
    "image-6": {
        "asset": "bloch_sphere_superposition.png",
        "caption": "This is what a qubit looks like mathematically when it is in superposition",
        "alttext": "Sphere in a coordinate system, at the south pole one, at the north pole zero; qubit is plotted as a point lying exactly on the equator."
    },
    "paragraph-8": {
        "text": "Grasping counter-intuitive quantum mechanics is a bit challenging; feel free to take your time and go back if you don't understand something. Everything clear? Then move on to the next lesson! At the end of each lesson, you'll find a button to complete it. Have fun!"
    }
}