{
    "paragraph-1": {
        "text": "Can we improve our approach? And how! Depending on the optimization problem, it is often possible to exceed the theoretical capacity limits of the quantum annealer like this and squeeze out additional problem sizes that would not have been possible otherwise."
    },
    "pagebreak-1": {
    },
    "sectiontitle-1": {
        "title": "One more queen"
    },
    "paragraph-2": {
        "text": "One way to solve the otherwise too hard 9 queens problem is, for example, to reduce the solution set. One could specify a queen in a corner, which is the top left in the image below, that **excludes** the positioning of further queens in the outermost row as well as column, in order to reduce the grid given to the annealer for processing to 8×8 and thus effectively let the 8 queens problem be solved instead. Do you recognize, however, what something else must be considered?"
    },
    "image-1": {
        "asset": "nine_queens.png",
        "caption": "A trick to solve the 9 queens problem: the clever positioning of the first piece",
        "alttext": "Bird's-eye view of a chessboard of size nine by nine with a queen piece in the upper right corner, its row, column, and diagonal shaded in blue; the remaining eight-by-eight square is occupied by eight queens in valid placement, none standing on the shaded squares."
    },
    "pagebreak-2": {
    },
    "paragraph-3": {
        "text": "The 8 queens problem here needs an additional rule, which says that the diagonal, which is in the range of the corner queen, must remain free, since it is already occupied. In mathematical terms, this means that **exactly 0 fields** should be occupied on this diagonal. To implement this, we simply adjust the QUBO equation of the diagonal, depending on which one it is:"
    },
    "equation-1": {
        "tex": "f\\left(a,f,k,p\\right)=\\left(a+f+k+p-\\frac{1}{2}\\right)^2\\Rightarrow f\\left(a,f,k,p\\right)=\\left(a+f+k+p\\right)^2",
        "alttext": "f(a,f,k,p)=(a+f+k+p-½)²⇒f(a,f,k,p)=(a+f+k+p)²"
    },
    "paragraph-4": {
        "text": "This would be an appropriate adjustment in the case of the 4 queens problem. Since in the new form the values of all fields are simply added, the least cost is reached only if all are 0, i.e. unoccupied. If we exchange this part of the QUBO problem and send the appropriately modified 64×64 Hamilton matrix to the quantum annealer, we actually find some correct solutions!"
    },
    "interactive-1": {
        "id": "",
        "caption": "Use the interactive element!",
        "alttext": "",
        "args": {}
    },
    "pagebreak-3": {
    },
    "paragraph-5": {
        "text": "So try to think outside the box and make the quantum computer's job easier by clever specifications!"
    }
}