{
    "paragraph-1": {
        "text": "Bei der Bedienung des DWave Advantage passiert viel Arbeit im Hintergrund. Ein Beispiel dafür, das wir bereits kennen, ist das Embedding auf der QPU; davon bekommt man bei einer standardmäßigen Anfrage meistens nicht viel mit, da sie von der Kommunikationsschnittstelle automatisch berechnet wird. Es gibt aber auch statische Werte, sogenannte **Hyperparameter**, die die Leistung des Algorithmus direkt beeinflussen und nur durch Ausprobieren optimiert werden können. In Verbindung mit der Auswertung unseres TSP-Algorithmus werden wir sie dieses Mal näher beleuchten."
    },
    "pagebreak-1": {
    },
    "sectiontitle-1": {
        "title": "Das richtige Benchmarking"
    },
    "paragraph-2": {
        "text": "Doch zunächst stellt sich die Frage: **Mit welchen Graphen soll der Quantenannealer geprüft werden?** Im Gegensatz zum Schachbrett beim N-Damen-Problem ist diese Datenstruktur viel flexibler und es ist nicht nur die Anzahl der Städte, sondern auch deren Lage entscheidend. Ein Ansatz für eine Vereinheitlichung ist es daher, Graphen in Form **regelmäßiger Polygone** (also Vielecke mit gleicher Seitenlänge) zu verwenden, beginnend mit einem Dreieck (die einfachste Form mit einem gültigen Hamiltonkreis) bis hin zu einem Achteck."
    },
    "image-1": {
        "asset": "benchmark_graphs.png",
        "caption": "Regelmäßige Polygone sind besonders geeignet, Algorithmen für Routenfindung zu testen",
        "alttext": "Dreieck, Viereck, Fünfeck, Sechseck, Siebeneck und Achteck mit jeweils gleicher Seitenlänge, dessen Ecken mit bunten Kreuzen markiert sind."
    },
    "paragraph-3": {
        "text": "Die Städte sind so gelegt, dass die Kantenlänge der Polygone 0,5 beträgt. Das hat gleich mehrere Vorteile:"
    },
    "paragraph-4": {
        "text": "1. Die kürzeste Tour und damit die richtige Lösung des Traveling-Salesman-Problems ist immer der **Umfang des Vielecks**.\n2. Es kann einfach ermittelt werden, ob der Quantenannealer korrekt liegt, da die optimale Energie durch die immer gleiche Kantenlänge mit einer Formel **hergeleitet** werden kann, die von der Anzahl der Ecken des Vielecks $$n$$ abhängt ($$h$$ ist der skalierte Koeffizient, der die Belegung von Städten begünstigt)."
    },
    "equation-1": {
        "tex": "\\min E=h\\times n+\\frac{1}{2}\\times n=\\left(h+\\frac{1}{2}\\right)\\times n",
        "alttext": "min E=h×n+½×n=(h+½)×n"
    },
    "pagebreak-2": {
    },
    "sectiontitle-2": {
        "title": "Optimierung der Hyperparameter"
    },
    "paragraph-5": {
        "text": "Die für unser Problem wichtigsten Hyperparameter sind **chain strength** und **annealing time**. Ersteres steht für die Gleichheitskopplungsstärke zwischen Qubits, die eine Kette auf der QPU bilden, d.h. die **Stärke der Magnetfelder**, die die Qubits zwingen, identische Werte anzunehmen. In ähnlicher Weise legt letzteres die **Zeitdauer** fest, die die Qubits sich ihrem optimalen Energiezustand annähern dürfen, bevor sie ausgelesen werden und die Superposition kollabiert. Für jeden dieser Werte gibt es Standards, die jedoch nicht immer die besten Ergebnisse liefern müssen."
    },
    "paragraph-6": {
        "text": "Der Optimierungsprozess ist langwierig und benötigt viele Daten, sie wird hier nicht tiefer behandelt; wenn du am detaillierten Verfahren interessiert bist, kannst du diese vom Download-Tab auf dem Homescreen beziehen. Unten sind die Diagramme, die den Verlauf der Erfolgsrate (dem Prozentsatz der richtigen Ergebnisse) beim DWave Advantage zeigen, wenn man die Kettenstärke erhöht — mit einer Kurve, die den Durchschnitt aus 10 verschiedenen Embeddings abbildet. Oben ist eine Lösung richtig, wenn es eine gültige Rundreise darstellt, unten, wenn es die kürzeste Rundreise ist."
    },
    "interactive-1": {
        "id": "56h_graph_chainstrength",
        "caption": "Verändere mit dem Schieberegler die Anzahl der Städte, um zu beobachten, wie die Kettenstärke die Erfolgsrate beeinflusst!",
        "alttext": "",
        "args": {
            "title_simple": "ohne Wegkosten",
            "title_complex": "mit Wegkosten",
            "values_simple": [
                [0.2166, 0.5884, 0.9436, 0.9836, 0.9796, 0.9696, 0.9378, 0.8670, 0.8286, 0.7570],
                [0.0000, 0.0016, 0.1518, 0.6464, 0.8854, 0.8786, 0.8146, 0.7032, 0.5870, 0.5044],
                [0.0000, 0.0000, 0.0014, 0.0758, 0.2608, 0.4590, 0.4654, 0.3696, 0.3056, 0.2170],
                [0.0000, 0.0000, 0.0002, 0.0086, 0.0822, 0.1870, 0.2120, 0.1718, 0.1400, 0.1008],
                [0.0000, 0.0000, 0.0018, 0.0140, 0.0358, 0.0564, 0.0782, 0.0642, 0.0448, 0.0362],
                [0.0000, 0.0000, 0.0000, 0.0006, 0.0036, 0.0094, 0.0172, 0.0216, 0.0152, 0.0096]
            ],
            "values_complex": [
                [0.1030, 0.4800, 0.9276, 0.9826, 0.9718, 0.9314, 0.8676, 0.7812, 0.7264, 0.6618],
                [0.0000, 0.0140, 0.0998, 0.2390, 0.3338, 0.3224, 0.2658, 0.2142, 0.1662, 0.1480],
                [0.0000, 0.0000, 0.0020, 0.0050, 0.0292, 0.0480, 0.0536, 0.0350, 0.0292, 0.0218],
                [0.0000, 0.0000, 0.0012, 0.0008, 0.0014, 0.0024, 0.0046, 0.0052, 0.0020, 0.0024],
                [0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000],
                [0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000]
            ]
        }
    },
    "paragraph-7": {
        "text": "Man merkt, dass stärkere Koppler bei logischen Qubits nicht immer **besser** sind: Die Genauigkeit hat bei allen Kurven einen Höhepunkt und fällt danach stetig ab. Bei größeren Stadtnetzwerken wird der Unterschied zwischen der einfacheren und der komplexeren Aufgabe immer größer, bis schließlich ab $$n=7$$ Städten der kürzeste Rundweg nicht mehr gefunden werden kann."
    },
    "pagebreak-3": {
    },
    "paragraph-8": {
        "text": "Das gleiche machen wir auch mit der annealing time; die Erwartungshaltung ist logischerweise, dass der Anteil der korrekten Lösungen immer weiter zunehmen sollte, je länger der Quantencomputer Zeit für die einzelnen Anneals hat."
    },
    "interactive-2": {
        "id": "56h_graph_annealingtime",
        "caption": "Verändere mit dem Schieberegler die Anzahl der Städte, um zu beobachten, wie die Länge der Anneals die Erfolgsrate beeinflusst!",
        "alttext": "",
        "args": {
            "title_simple": "ohne Wegkosten",
            "title_complex": "mit Wegkosten",
            "values_simple": [
                [0.9040, 0.9690, 0.9870, 0.9930, 0.9930, 1.0000, 0.9980, 0.9980, 0.9960, 0.9980],
                [0.2980, 0.4160, 0.5980, 0.6890, 0.8160, 0.8270, 0.8730, 0.9040, 0.9110, 0.9420],
                [0.0270, 0.1530, 0.2600, 0.3730, 0.4530, 0.5420, 0.6310, 0.6910, 0.7490, 0.8400],
                [0.0000, 0.0310, 0.0980, 0.1760, 0.2270, 0.2870, 0.3270, 0.3440, 0.4600, 0.4620],
                [0.0000, 0.0020, 0.0070, 0.0200, 0.0400, 0.1070, 0.1200, 0.1220, 0.2400, 0.1510],
                [0.0000, 0.0000, 0.0040, 0.0000, 0.0040, 0.0020, 0.0090, 0.0070, 0.0160, 0.0200]
            ],
            "values_complex": [
                [0.7840, 0.9220, 0.9360, 0.9600, 0.9780, 0.9820, 0.9760, 0.9890, 1.0000, 1.0000],
                [0.0960, 0.1960, 0.2000, 0.2760, 0.3000, 0.3110, 0.2910, 0.2640, 0.3620, 0.3560],
                [0.0000, 0.0000, 0.0020, 0.0050, 0.0292, 0.0480, 0.0536, 0.0350, 0.0292, 0.0218],
                [0.0000, 0.0000, 0.0020, 0.0020, 0.0000, 0.0000, 0.0000, 0.0000, 0.0020, 0.0000],
                [0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0020, 0.0000, 0.0020, 0.0000, 0.0000],
                [0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000, 0.0000]
            ]
        }
    },
    "paragraph-9": {
        "text": "Unsere Annahme hat sich bestätigt, aber auch hier zeigt sich das Problem des Leistungsabfalls, wenn die Wegkosten berücksichtigt werden. Das liegt an einem Konzept, welches sich **Spärlichkeit** (auf Englisch \"sparsity\") nennt. Je spärlicher die Hamilton-Matrix ist, sprich **je mehr Nullen** sie hat, desto besser kann ein Quantenannealer sie lösen — denn wenn kein Koeffizient vorliegt, kann man mehr Koppler einsparen, wodurch die Komplexität und der Zufallsfaktor des QPU-Embeddings reduziert werden. Die Wegkosten kommen in der QUBO-Gleichung als Koeffizienten vor, die vorher 0 waren, was die Spärlichkeit der Hamilton-Matrix senkt."
    }
}