{
    "sectiontitle-1": {
        "title": "Verbindungen mathematisch darstellen"
    },
    "paragraph-1": {
        "text": "Computer können nur mit Zahlen arbeiten, also müssen wir auch mit ihnen umgehen. Die vorherige Einheit hat mit den Städten, die durch Linien untereinander verbunden sind, bereits ein Schlüsselkonzept der Lösungsmethode eingeführt: **Graphen** sind ein grundlegender Bestandteil der Mathematik, und zwar so sehr, dass sie ein eigenes Fachgebiet namens **Graphentheorie** besitzen. Im Allgemeinen beschreibt ein Graph eine Menge von Städten, **Knoten** genannt, und wie sie mathematisch miteinander verbunden sind."
    },
    "paragraph-2": {
        "text": "Vereinfachen wir unser Beispiel von vorhin auf nur 4 Städte mit dem Namen A, B, C und D."
    },
    "image-1": {
        "asset": "graph_example.png",
        "caption": "Ein simpler Graph mit 4 Knoten sowie ihren Abständen zueinander",
        "alttext": "Vier bunte Kreise beschriftet mit A, B, C und D, durch graue Linien mit jeweils einer Zahl daneben verbunden."
    },
    "pagebreak-1": {
    },
    "paragraph-3": {
        "text": "Jeder Knoten wird als bunter Kreis dargestellt, der mit anderen Knoten durch Kanten verbunden ist, wobei die Abstände zwischen den Knoten in grau notiert sind. Im Beispiel ist jedes mögliche Knotenpaar miteinander verbunden, jede Kante kann in beide Richtungen durchlaufen werden und jeder Kante ist ein eindeutiger Distanzwert, ein sogenanntes \"Gewicht\" zugewiesen. Dies wird als **vollständiger, ungerichteter und gewichteter Graph** bezeichnet. Graphen können verschiedene Arten und Formen annehmen, aber in diesem Kurs konzentrieren wir uns nur auf diese eine Kategorie, da er der Standarddefinition des TSP entspricht. Mathematisch gesehen lässt sich ein solcher Graph wie folgt charakterisieren:"
    },
    "equation-1": {
        "tex": "G=\\left(V,E,d\\right)",
        "alttext": "G=(V,E,d)"
    },
    "equation-2": {
        "tex": "V=\\left{v_1,v_2,...\\right}",
        "alttext": "V={v₁,v₂,...,vₙ}"
    },
    "equation-3": {
        "tex": "E\\subseteq\\left{\\left{v_i,v_j\\right}|\\left(v_i,v_j\\right)\\in V^2\\wedge v_i\\neq v_j\\right}",
        "alttext": "E⊆{{vᵢ,vⱼ}|(vᵢ,vⱼ)∈V²∧vᵢ≠vⱼ}"
    },
    "equation-4": {
        "tex": "d:E\\to\\mathbb{R}",
        "alttext": "d:E→ℝ"
    },
    "paragraph-4": {
        "text": "Ganz schön viel auf einmal; hier also Schritt für Schritt:"
    },
    "paragraph-5": {
        "text": "- Ein Graph $$G$$ besteht aus drei Komponenten: $$V$$, die Knoten (von Englisch \"vertices\"), $$E$$, die Kanten (von Englisch \"edges\"), und $$d$$, die Distanzfunktion. Die Notation mit () als ein Tripel verdeutlicht, dass sie zusammengehören.\n- $$V$$ bezeichnet die Menge der Knoten, aus denen ein Graph besteht. Mengen erkennt man an den geschweiften Klammern {}.\n- $$E$$ ist die Menge der Kanten, dargestellt als nicht geordnete Knotenpaare $${v_i,v_j}$$. Der senkrechte Strich | definiert, welche Bedingungen diese Paare erfüllen müssen: Sowohl $$v_i$$ als auch $$v_j$$ müssen Teil von $$V^2$$ sein (\"hoch zwei\" steht in der Mengenschreibweise für das kartesische Produkt, d.h. die Menge aller möglichen Kombinationen der Elemente einer Menge) und $$v_i$$ darf nicht gleich $$v_j$$ sein, um Schleifen zu vermeiden.\n- $$d$$ ist eine Funktion, die jeder Kante (also einem ungeordneten Paar von Knoten) eine reelle Zahl zuordnet, in diesem Fall die Länge."
    },
    "pagebreak-2": {
    },
    "paragraph-6": {
        "text": "Unser Beispielgraph kann also wie folgt beschrieben werden:"
    },
    "equation-5": {
        "tex": "V=\\left{A,B,C,D\\right}",
        "alttext": "V={A,B,C,D}"
    },
    "equation-6": {
        "tex": "E=\\left{\\left{A,B\\right},\\left{A,C\\right},\\left{A,D\\right},\\left{B,C\\right},\\left{B,D\\right},\\left{C,D\\right}\\right}",
        "alttext": "E={{A,B},{A,C},{A,D},{B,C},{B,D},{C,D}}"
    },
    "equation-7": {
        "tex": "d:E\\to\\begin{cases}5.7 & \\text{wenn }E=\\left\\{A,B\\right\\} \\\\ 2.5 & \\text{wenn }E=\\left\\{A,C\\right\\} \\\\ 3.3 & \\text{wenn }E=\\left\\{A,D\\right\\} \\\\ 3.4 & \\text{wenn }E=\\left\\{B,C\\right\\} \\\\ 5.6 & \\text{wenn }E=\\left\\{B,D\\right\\} \\\\ 4.1 & \\text{wenn }E=\\left\\{C,D\\right\\}\\end{cases}",
        "alttext": "d:E→{5.7 wenn E={A,B},2.5 wenn E={A,C},3.3 wenn E={A,D},3.4 wenn E={B,C},5.6 wenn E={B,D},4.1 wenn E={C,D}"
    },
    "pagebreak-3": {
    },
    "paragraph-7": {
        "text": "Pfade sind dabei eine Reihenfolge von Knoten, die nacheinander besucht werden. Ein Pfad, der alle Knoten genau einmal passiert, ohne Kanten mehrfach zu durchlaufen, heißt **Hamiltonpfad**. Ein Hamiltonpfad, dessen Start- und Endpunkt gleich sind, heißt wiederum geschlossener Hamiltonpfad oder **Hamiltonkreis** — beim TSP wird derjenige davon gesucht, bei der die Summe der Distanzen aus der Distanzfunktion so gering wie möglich ist. Sowohl ersteres als auch letzteres sind bei vollständigen Graphen in jedem Fall vorhanden."
    },
    "interactive-1": {

    }
}