{
    "sectiontitle-1": {
        "title": "Uralt und doch neu"
    },
    "paragraph-1": {
        "text": "Wenn es um **Sudoku** geht, hat man es wahrlich mit einem wiederauferstandenen Fossil zu tun. Es ist eines der populärsten Logikrätsel unserer Zeit — jedoch definitiv keine neue Erfindung. Schon vor über 4000 Jahren wurde im antiken China fieberhaft Sudoku gespielt; damals war es unter dem Namen \"magische Quadrate\" bekannt. In diesen Jahrtausenden faszinierte das Spiel über alle Epochen, nicht zuletzt, da es sich einfach nie zu wiederholen scheint. Mittlerweile wissen wir, dass beim klassischen 9×9-Sudoku **sechs Trilliarden individuelle Konstellationen** möglich sind — richtig gelesen, eine Sechs mit 21 Nullen. Damit könnte die gesamte Erdbevölkerung Millionen Jahre lang täglich mehrere Sudokus lösen, ohne je zwei identischen zu begegnen."
    },
    "image-1": {
        "asset": "sudoku_example_empty.png",
        "caption": "Ein Beispiel für ein klassisches 9×9-Sudoku in Ausgangslage",
        "alttext": "Quadrat, das in neun mal neun kleine Quadrate zerteilt ist; in einigen Feldern sind Ziffern von eins bis neun in dicker brauner Schrift eingetragen."
    },
    "pagebreak-1": {
    },
    "paragraph-2": {
        "text": "Die Regeln des Rätsels sind einfach wie genial: In einem Gitter der Größe 9×9 Felder muss in jedes Feld eine Ziffer von 1 bis 9 so eingetragen werden, dass:"
    },
    "paragraph-3": {
        "text": "- in jeder Zeile jede Ziffer **genau einmal** vorkommt und\n- in jeder Spalte jede Ziffer **genau einmal** vorkommt."
    },
    "paragraph-4": {
        "text": "Zusätzlich ist das Gitter in 9 Unterquadrate der Größe 3×3 unterteilt; in diesen darf ebenfalls jede Ziffer genau einmal vorkommen. Andere Sudoku-Größen, in denen diese Art von Unterteilung möglich ist, sind 4×4 und 16×16 Felder. Um einen Anhaltspunkt zum Ausfüllen zu geben, sind einige Ziffern vorgegeben, von denen die restlichen den obigen Regeln folgend hergeleitet werden müssen."
    },
    "image-2": {
        "asset": "assets/images/lessons/sudoku_example_solved.png",
        "caption": "Das Sudoku von vorhin — vollständig ausgefüllt und damit gelöst",
        "alttext": "Quadrat, das in neun mal neun kleine Quadrate zerteilt ist; in einigen Feldern sind Ziffern von eins bis neun in dicker brauner Schrift eingetragen, in den restlichen Ziffern in dünner roter Schrift."
    },
    "pagebreak-2": {
    },
    "paragraph-5": {
        "text": "Da es also eine gewaltige Menge an Möglichkeiten gibt und die Einträge voneinander abhängen, kann das Rätsel auch als Optimierungsproblem aufgefasst werden. Hier bieten Quantenannealer ein gewaltiges Potenzial: Mit ihnen wäre es nicht nur möglich, Sudokus unabhängig von ihrer Größe auf einen Schlag auszufüllen, sondern aufgrund der Superposition der Qubits alle möglichen Konstellationen **zur gleichen Zeit** zu betrachten. Aber trifft das alles wirklich zu? Diese abschließende Lektion möchte dieser Fragestellung nachgehen und aufzeigen, wie wichtig es dabei ist, nicht den Überblick über das zu lösende Problem zu verlieren."
    }
}