{
    "sectiontitle-1": {
        "title": "Mathematische Modellierung von Aufgaben"
    },
    "paragraph-1": {
        "text": "Quantenannealer sind (noch) sehr angepasst; sie können nur ganz bestimmte Probleme modellieren und lösen. Die einführende Lektion hat bereits erläutert, welche diese sind: Die QUBO-Probleme. Der erste Schritt bei der Problemlösung mit Quantenannealern ist demnach, die Aufgabe als eine QUBO-Gleichung zu formulieren, welche dann die niedrigsten Kosten ausgibt, wenn die korrekte Lösung gefunden wurde."
    },
    "paragraph-2": {
        "text": "Vielleicht erkennst du bereits die Parallele: Bei diesem oftmals eher abstrakten Schritt ist es hilfreich, die Problemstellung bildlich zu betrachten und **als ein Gitter darzustellen**. Beim N-Damen-Problem ist dies glücklicherweise ziemlich offensichtlich: Die Felder des Schachbretts sind die Variablen a, b, c usw, auf denen sich entweder eine Dame befindet (1) oder nicht (0). Wenn du dich an die entsprechende Einheit der ersten Lektion erinnerst, wurde dort der gleiche Ansatz angewandt. Betrachten wir das einfachste Beispiel des 4-Damen-Problems:"
    },
    "image-1": {
        "asset": "chessboard_variables.png",
        "caption": "Ein 4×4-Schachbrett mit beschrifteten Feldern",
        "alttext": "Ein Schachbrett der Größe vier mal vier, Felder sind in alphabetischer Reihenfolge von a nach p beschriftet."
    },
    "pagebreak-1": {
    },
    "paragraph-3": {
        "text": "Wir beschriften die Felder alphabetisch von a bis p, die je nach dem ihren Binärwert verändern, ob sie mit einer Dame **belegt** sind oder **nicht**. Das ist deswegen nützlich, weil nun jede mögliche Stellung der 4 Damen auf dem Brett durch eine Zahlenreihe, bestehend aus 16 Einsen und Nullen, dargestellt werden kann — mathematisch ausgedrückt: Ein Vektor mit 16 Koordinaten. Diese Modellierungstechnik wird auch **One-Hot Encoding** genannt."
    },
    "equation-1": {
        "tex": "q=\\begin{bmatrix}a&b&c&d&e&f&g&h&i&j&k&l&m&n&o&p\\end{bmatrix}",
        "alttext": "q=[a,b,c,d,e,f,g,h,i,j,k,l,m,n,o,p]"
    },
    "equation-2": {
        "tex": "\\begin{bmatrix}0&1&0&0&0&0&0&1&1&0&0&0&0&0&1&0\\end{bmatrix}\\Rightarrow",
        "alttext": "[0,1,0,0,0,0,0,1,1,0,0,0,0,0,1,0]⇒"
    },
    "image-2": {
        "asset": "four_queens_problem.png",
        "caption": "Die Lösung des 4-Damen-Problems, welches vom obigen Vektor dargestellt wird",
        "alttext": "Ein Schachbrett der Größe vier mal vier mit vier Damenfiguren in einer Konstellation, dass keine eine andere schlagen kann."
    },
    "pagebreak-2": {
    },
    "paragraph-4": {
        "text": "Nun können wir, ausgehend von den Regeln im Schach, unsere Regeln festlegen:"
    },
    "paragraph-5": {
        "text": "1. Pro Zeile soll **genau eine** Dame stehen\n2. Pro Spalte soll **genau eine** Dame stehen\n3. Pro Diagonale **muss keine, darf aber höchstens eine** Dame stehen"
    },
    "paragraph-6": {
        "text": "Diese Regeln können durch logische Begründungen hergeleitet werden: Da das Schachfeld N×N groß ist und mehrere Damen nicht in der gleichen Zeile stehen dürfen (da sie sich sonst gegenseitig bedrohen würden), müssen die N Damen so verteilt werden, dass keine Zeile frei bleiben darf und jede genau eine beinhaltet. Ähnlich verhält es sich mit den Spalten, da Damen auch eine beliebige Distanz in vertikaler Richtung zurücklegen können. In einem 4×4-Schachbrett gibt es 5 Diagonalen von links nach rechts und 5 von rechts nach links, das wäre zu viel für 4 Damen (obwohl eine Dame sich immer in 2 Diagonalen gleichzeitig befindet). Daher müssen nicht alle belegt werden, pro Diagonale darf es aber aufgrund der Bedrohungslage trotzdem höchstens eine Dame geben."
    },
    "pagebreak-3": {
    },
    "sectiontitle-2": {
        "title": "Die Umsetzung der Regeln"
    },
    "paragraph-7": {
        "text": "Für die Zeilen ist folgende QUBO-Form korrekt:"
    },
    "image-3": {
        "asset": "row_highlight.png",
        "caption": "QUBO-Gleichung am Beispiel einer Zeile",
        "alttext": "Ein Schachbrett der Größe vier mal vier, dessen oberste Reihe an Feldern blau schattiert ist."
    },
    "equation-3": {
        "tex": "f\\left(a,b,c,d\\right)=\\left(a+b+c+d-1\\right)^2",
        "alttext": "f(a,b,c,d)=(a+b+c+d-1)²"
    },
    "paragraph-8": {
        "text": "Das Quadrieren sorgt dafür, dass nur dann die **geringsten Kosten** entstehen, wenn $$a+b+c+d-1$$ gleich 0 ist, d.h. wenn aus allen Feldern der Zeile nur eines belegt ist (wie auch in der Einführungslektion dargestellt). Das wird auf alle Zeilen übertragen und addiert. Für die Spalten genauso:"
    },
    "image-4": {
        "asset": "column_highlight.png",
        "caption": "QUBO-Gleichung am Beispiel einer Spalte",
        "alttext": "Ein Schachbrett der Größe vier mal vier, dessen linke Spalte an Feldern blau schattiert ist."
    },
    "equation-4": {
        "tex": "f\\left(a,e,i,m\\right)=\\left(a+e+i+m-1\\right)^2",
        "alttext": "f(a,e,i,m)=(a+e+i+m-1)²"
    },
    "pagebreak-4": {
    },
    "paragraph-9": {
        "text": "Um die \"höchstens 1 Belegung\"-Regel für die Diagonalen zu verwirklichen, wird dieses Mal ½ statt 1 in der Klammer subtrahiert; damit verschiebt sich das Minimum der Funktion so, dass 0 **oder** 1 die Summe der Felder sein kann. Wenn man das ausmultipliziert, ist ersichtlich, dass das im Endeffekt bedeutet, dass alle paarweise Belegungen dieser Felder **mit einer Strafe belegt** ist. Die Korrektheit kann auch mit einer sogenannten Wahrheitstabelle überprüft werden. Insgesamt gibt es beim N-Damen-Problem $$2(2N-3)=4N-6$$ Diagonalen zu berücksichtigen."
    },
    "equation-5": {
        "tex": "f\\left(a,f,k,p\\right)=\\left(a+f+k+p-\\frac{1}{2}\\right)^2",
        "alttext": "f(a,f,k,p)=(a+f+k+p-½)²"
    },
    "image-5": {
        "asset": "diagonal_highlight.png",
        "caption": "QUBO-Gleichung am Beispiel einer Diagonale",
        "alttext": "Ein Schachbrett der Größe vier mal vier, bei dem eine Querdiagonale an Feldern blau schattiert ist."
    },
    "image-6": {
        "asset": "truth_table.png",
        "caption": "Eine Wahrheitstabelle listet alle möglichen Paare von Ein- und Ausgaben einer Funktion auf. 0 und 1 Belegungen ergeben in dieser Diagonalen die niedrigsten Kosten",
        "alttext": "Tabelle mit Eingabewerten x in der ersten Zeile und Funktionswerten f in der zweiten Spalte; null zu null-komma-zwei-fünf, eins zu null-komma-zwei-fünf, zwei zu zwei-komma-zwei-fünf, drei zu sechs-komma-zwei-fünf, vier zu zwölf-komma-zwei-fünf."
    }
}