{
    "paragraph-1": {
        "text": "Eine örtliche Müllabfuhr muss am Anfang jeder Woche die Bewohner einer Stadt besuchen, um ihre Müllcontainer zu leeren. Stell dir vor, du wärst dafür zuständig, die Route für die Flotte der Müllabfuhrflotte festzulegen. Wie würdest du vorgehen, um sicherzustellen, dass die Fahrzeuge möglichst schnell fertig sind, möglichst wenig Sprit verbrauchen, vielleicht dass kein Fahrzeug überlastet ist?"
    },
    "image-1": {
        "asset": "optimization_introduction.png",
        "caption": "Der Fahrplan einer Müllabfuhr muss gut geplant sein, damit keine Ressourcen verschwendet werden",
        "alttext": "Zwei Müllwägen fahren auf den Straßen einer Graslandschaft mit mehreren Häusern; aus der Vogelperspektive."
    },
    "paragraph-2": {
        "text": "Dieses Szenario ist ein klassisches Beispiel für **Optimierungsprobleme**; sie spielen in diesem Kurs eine große Rolle, da das die eine Art von Aufgaben ist, die Quantenannealer (potenziell) schneller und effizienter lösen können als herkömmliche Computer. Je größer die Stadt ist, desto höher ist die Anzahl der theoretisch möglichen Routen für die Müllabfuhr; hier sind wir schnell bei mehreren Milliarden Möglichkeiten. Alle zu berechnen und durchzuprobieren, um die optimalste Lösung zu finden — dies wird \"brute force\" (\"rohe Kraft\") genannt — ist unmöglich, da jahrzehntelange Rechenarbeit nötig wäre."
    },
    "sectiontitle-1": {
        "title": "Strategische Annäherung"
    },
    "paragraph-3": {
        "text": "Es muss also eine andere Herangehensweise her. Bisher war die vorherrschende Strategie, die beste Lösung Schritt für Schritt so gut wie möglich anzunähern. Dafür ist jedoch ein objektives Maß nötig, woran man messen kann, welche Lösungen besser sind als andere. Daher besteht jedes Optimierungsproblem aus mindestens zwei Komponenten:"
    },
    "paragraph-4": {
        "text": "1. Kosten: Zahlen, die bewerten, wie \"gut\" eine bestimmte Lösung für das Problem ist\n2. Kostenfunktion: Eine Gleichung, welche die Kosten für eine bestimmte Lösungskonstellation berechnet"
    },
    "paragraph-5": {
        "text": "Die Komplexität der Kostenfunktion hängt von der Anzahl der zu optimierenden Parameter ab; bei einer Unbekannten kann man es sich als eine Kurve vorstellen:"
    },
    "image-2": {
        "asset": "quadratic_qubo.png",
        "caption": "Der tiefste Punkt (Minimum) der Kostenfunktion ist zugleich die beste Lösung des Optimierungsproblems",
        "alttext": "Nach oben geöffnete parabelförmige Kurve im Koordinatensystem; nummerierte Lösungen x-Achse, Kosten y-Achse; tiefster Punkt markiert mit einem Pfeil und der Beschriftung Minimum."
    },
    "paragraph-6": {
        "text": "Nehmen wir an, wir möchten die Anzahl der Haushalte optimieren, die die einzelnen Müllwagen anfahren. Im obigen Graphen kann man ablesen, wie sich die Kosten mit dieser Anzahl verändern. Hier gilt: Je niedriger die Kosten, desto besser eine Lösung. Laut dem Graphen wäre also die beste Lösung $$n = 3$$, da hier die geringsten Kosten entstehen."
    },
    "paragraph-7": {
        "text": "Die Herausforderung dabei: Der Computer, der das Problem lösen soll, sieht auf dieser Kostenkurve immer nur einen Punkt auf einmal und muss eine Strategie entwickeln, trotzdem die \"Täler\", also die Lösungen mit den niedrigsten Kosten, zu finden. Es ist möglich, dabei das **globale Optimum**, die niedrigsten Kosten von allen, zu finden, aber man kann genauso gut bei einem **lokalen Optimum**, einem der vielen mitteltiefen Tälern, landen — im Glauben, der tiefste Punkt sei bereits erreicht."
    },
    "interactive-1": {

    },
    "sectiontitle-2": {
        "title": "Mit Quantencomputern optimieren"
    },
    "paragraph-8": {
        "text": "Doch wie kommt jetzt Quantencomputing ins Spiel? Durch die Fähigkeit der Qubits, sich in einer Superposition zu befinden, sehen sie (bildlich gesprochen) die ganze Kostenfunktion auf einmal und können gleich zum tiefsten Tal \"springen\". Dafür sind gleich mehrere quantenphysikalische Eigenschaften der Qubits verantwortlich: Der Grundzustand und der Quantentunneleffekt."
    },
    "paragraph-9": {
        "text": "Quantenmechanische Systeme besitzen eine Art \"innere Energie\" und streben danach, dass diese **möglichst niedrig** ist. Der Zustand der geringsten Energie wird auch Grundzustand oder auch Nullpunktenergie bezeichnet."
    },
    "image-3": {
        "asset": "energy_levels.png",
        "caption": "Verschiedene Energiestufen von Teilchen: Der Grundzustand und erregte Zustände",
        "alttext": "Diagramm mit farbigen horizontalen Linien auf verschiedenen Höhen neben einem Pfeil als x-Achse mit der Aufschrift Energie; die tiefste Linie ist beschriftet als Grundzustand, die höher gelegenen als erregte Zustände."
    },
    "paragraph-10": {
        "text": "Zusätzlich besitzen Quantenteilchen wie z.B. Elektronen die Fähigkeit, sich zu bestimmten Energieniveaus zu \"tunneln\". Da, wie in vorherigen Einheiten beschrieben, die Position und die Geschwindigkeit eines Elektrons keine festen Werte, sondern eine Wahrscheinlichkeitswolke sind, ist es den Teilchen möglich, gleich zu niedrigeren Energieniveaus zu springen, ohne vorherige, möglicherweise höhere Energiestufen durchlaufen zu haben. Dies nennt man \"quantum tunneling\", oder auch **Quantentunneleffekt**."
    },
    "image-4": {
        "asset": "quantum_tunneling.png",
        "caption": "Anstatt den klassischen Weg zu gehen, ist es kleinsten Teilchen auch möglich, sich durchzutunneln",
        "alttext": "Diagramm von einer Energiekurve mit einem hohen Hügel in der Mitte; Von einem Kreis, der in einem Tal vor dem Hügel mit lokales Minimum beschriftet liegt, zeigt ein Pfeil durch den Hügel in ein tieferes Tal nach dem Hügel mit globales Minimum beschriftet."
    },
    "image-5": {
        "asset": "annealing_process.png",
        "caption": "Energieniveaus sind nicht statisch, sondern verändern sich im Laufe des Annealings",
        "alttext": "Diagramm mit mehreren flachen Kurven, die eng beieinander verlaufen. x-Achse ist mit Kosten, y-Achse mit Zeit beschrieben. Auf die Stelle, wo der Abstand der Kurven besonders klein ist, zeigt ein Pfeil mit der Aufschrift Minimum Gap."
    },
    "paragraph-11": {
        "text": "Vielleicht ahnst du schon, worauf es hinausläuft: Diese Effekte wollen Quantenannealer ausnutzen, indem man versucht, die Energiekurve der QPU (durch die Programmierung der Koppler) der vorhin behandelten Kostenkurve anzupassen, damit diese **ungefähr gleich aussehen**. Der Vorgang des \"annealings\", also des \"Abkühlens\", ist nichts anderes, als die Superposition der Qubits durch gezielte Messungen stückweise zerfallen zu lassen, damit sie den Zustand der geringsten Energie anstreben und ihre Werte so annehmen, dass sie die beste Lösung für das ursprüngliche Optimierungsproblem darstellen. Wo die Energiekurven eng zusammenlaufen, beim sogenannten \"minimum gap\", besteht die Chance, dass durch die Tunneleffekte nicht die optimalste Lösung rauskommt, deswegen führen Quantenannealer meist mehrere hundert Anneals durch und sind dabei extrem schnell, da ein Anneal nur ca. 20 Mikrosekunden (0.00002 Sekunden) dauert!"
    }
}